tutorials/multiRegion/film/rivuletBox/system/extrudeToRegionMeshDict.panel
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      extrudeToRegionMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

region          panel;

patches         (film);

adaptMesh       no;

regionPatchTypes   (wall);
regionPatchNames   (filmWall);

regionOppositePatchTypes    (wall);
regionOppositePatchNames    (insulatedWall);

extrudeModel
{
    type            linearNormal;

    nLayers         1;
    expansionRatio  1;

    thickness       0.002;
}

// ************************************************************************* //
